Revit 2024 API
ElementSet.Erase Method
Removes a specified element from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Erase(
	Element item
)
Visual Basic
Public Overridable Function Erase ( _
	item As Element _
) As Integer
Visual C++
public:
virtual int Erase(
	Element^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Element
The element to be erased.
Return Value
The number of elements that were erased from the set.
See Also
ElementSet Class
Autodesk.Revit.DB Namespace